# Pandas'ın İmport Edilmesi

In [1]:
import pandas as pd

# İlk Dataframe'i Oluşturma

In [2]:
userInfo = {
    "Adi" : ["Okan", "Betül" ,"Mehmet", "Ali", "Veli", "Uğur"],
    "Maas": [1000, 2000, 3000, 4000, 5000, 6000],
    "Yas" : [22, 23, 25, 26, 27, 28]
           }

In [3]:
dataframe1 = pd.DataFrame(userInfo)

In [4]:
dataframe1

      Adi  Maas  Yas
0    Okan  1000   22
1   Betül  2000   23
2  Mehmet  3000   25
3     Ali  4000   26
4    Veli  5000   27
5    Uğur  6000   28

## Head ve Tail ile İlk 5 ve Son 5 Veriyi Okuyabiliriz

In [5]:
dataframe1.head()

      Adi  Maas  Yas
0    Okan  1000   22
1   Betül  2000   23
2  Mehmet  3000   25
3     Ali  4000   26
4    Veli  5000   27

In [6]:
dataframe1.tail()

      Adi  Maas  Yas
1   Betül  2000   23
2  Mehmet  3000   25
3     Ali  4000   26
4    Veli  5000   27
5    Uğur  6000   28

## Columuns İle Veri Setinin Kolonlarını Görebiliriz

In [7]:
dataframe1.columns

Index(['Adi', 'Maas', 'Yas'], dtype='object')

## Veri Seti Hakkıda Daha Fazla Bilgi Edinmek İçin info() Methodunu Kullanırız

In [8]:
dataframe1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Adi     6 non-null      object
 1   Maas    6 non-null      int64
 2   Yas     6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

## Veri setinin Alanlarının Türünü Öğrenmek İsteyebiliriz

In [9]:
dataframe1.dtypes

Adi     object
Maas     int64
Yas      int64
dtype: object

### Pandas ile veri setindeki değerlerin temel istatistiksel değerlerini hesaplattırabiliriz

In [10]:
dataframe1.describe()

              Maas        Yas
count     6.000000   6.000000
mean   3500.000000  25.166667
std    1870.828693   2.316607
min    1000.000000  22.000000
25%    2250.000000  23.500000
50%    3500.000000  25.500000
75%    4750.000000  26.750000
max    6000.000000  28.000000

In [11]:
dataframe1["Adi"]

0      Okan
1     Betül
2    Mehmet
3       Ali
4      Veli
5      Uğur
Name: Adi, dtype: object

### Alternatif

In [12]:
dataframe1.Adi

0      Okan
1     Betül
2    Mehmet
3       Ali
4      Veli
5      Uğur
Name: Adi, dtype: object

### dataframe.loc[almak istediğimiz satır sayısı, Seçmek istediğimiz sütun aralığı]

- Dataframe.loc[:,"Başlangıç": "Bitiş"] 
- : tüm sütünları temsil eder.

#### Sadece belirli satır almak için

- Dataframe.loc[0:2, "Maas": "Yas"]

Not: Pandasta başlangıç ve bitişin dahil edildiğini unutmayın.

In [13]:
dataframe1.loc[0:2, "Maas":"Yas"]

   Maas  Yas
0  1000   22
1  2000   23
2  3000   25

In [14]:
dataframe1.columns

Index(['Adi', 'Maas', 'Yas'], dtype='object')

In [16]:
dataframe1.loc[:, ["Adi", "Yas"]]

      Adi  Yas
0    Okan   22
1   Betül   23
2  Mehmet   25
3     Ali   26
4    Veli   27
5    Uğur   28

In [18]:
dataframe1.iloc[:, 0]

0      Okan
1     Betül
2    Mehmet
3       Ali
4      Veli
5      Uğur
Name: Adi, dtype: object

## Dataframemimize Yeni bir alan ekleyebiliriz.

In [20]:
dataframe1["Soyadi"] = ["Yeşiloğlu", "Sönmezgül", "Kaya", "deneme", "deneme1", "Ünsaldi"]

In [21]:
dataframe1

      Adi  Maas  Yas     Soyadi
0    Okan  1000   22  Yeşiloğlu
1   Betül  2000   23  Sönmezgül
2  Mehmet  3000   25       Kaya
3     Ali  4000   26     deneme
4    Veli  5000   27    deneme1
5    Uğur  6000   28    Ünsaldi

# Yeni Bir Alan Ekleme

In [34]:
dataframe1[dataframe1.Yas > 25]

    Adi  Maas  Yas   Soyadi
3   Ali  4000   26   deneme
4  Veli  5000   27  deneme1
5  Uğur  6000   28  Ünsaldi

In [36]:
dataframe1["Durum"] = ["Genç" if each < 25 else "Yaşlı" for each in dataframe1.Yas]

In [37]:
dataframe1

      Adi  Maas  Yas     Soyadi  Durum
0    Okan  1000   22  Yeşiloğlu   Genç
1   Betül  2000   23  Sönmezgül   Genç
2  Mehmet  3000   25       Kaya  Yaşlı
3     Ali  4000   26     deneme  Yaşlı
4    Veli  5000   27    deneme1  Yaşlı
5    Uğur  6000   28    Ünsaldi  Yaşlı

# Alan Silme

In [38]:
dataframe1.drop(["Soyadi"], axis = 1, inplace= False)

      Adi  Maas  Yas  Durum
0    Okan  1000   22   Genç
1   Betül  2000   23   Genç
2  Mehmet  3000   25  Yaşlı
3     Ali  4000   26  Yaşlı
4    Veli  5000   27  Yaşlı
5    Uğur  6000   28  Yaşlı

In [39]:
dataframe1

      Adi  Maas  Yas     Soyadi  Durum
0    Okan  1000   22  Yeşiloğlu   Genç
1   Betül  2000   23  Sönmezgül   Genç
2  Mehmet  3000   25       Kaya  Yaşlı
3     Ali  4000   26     deneme  Yaşlı
4    Veli  5000   27    deneme1  Yaşlı
5    Uğur  6000   28    Ünsaldi  Yaşlı

In [40]:
dataframe1.drop(["Soyadi"], axis = 1, inplace= True)

In [41]:
dataframe1

      Adi  Maas  Yas  Durum
0    Okan  1000   22   Genç
1   Betül  2000   23   Genç
2  Mehmet  3000   25  Yaşlı
3     Ali  4000   26  Yaşlı
4    Veli  5000   27  Yaşlı
5    Uğur  6000   28  Yaşlı

### Dataframeleri Birleştirme

In [56]:
df1 = pd.DataFrame({"letter": ['a','b'],
                   "number": [1,2]})
df2 = pd.DataFrame({"letter": ['c','d'],
                   "number": [3,4]})

In [55]:
pd.concat([df1, df2], axis =0) # Dikey

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [54]:
pd.concat([df1, df2], axis =1) # Yatay

  letter  number letter  number
0      a       1      c       3
1      b       2      d       4